{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 16, "kernel_regularizer": null, "strides": [4, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "name": "dense_1", "units": 256, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_2", "units": 3, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}