{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "kernel_size": [8, 8], "dtype": "float32", "filters": 32, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "strides": [4, 4], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "batch_input_shape": [null, 2, 22, 22]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "filters": 64, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "batch_input_shape": [null, 2, 22, 22]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "use_bias": true, "units": 256, "trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "use_bias": true, "units": 3, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}]}