{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 2, 22, 22], "bias_constraint": null, "data_format": "channels_first", "kernel_constraint": null, "kernel_size": [8, 8], "bias_regularizer": null, "filters": 32, "padding": "valid", "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 2, 22, 22], "bias_constraint": null, "data_format": "channels_first", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 4, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear"}}], "class_name": "Sequential"}