{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "dtype": "float32", "strides": [4, 4], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [8, 8], "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 2, 22, 22], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "dilation_rate": [1, 1], "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 2, 22, 22], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "dilation_rate": [1, 1], "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "units": 256, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "units": 4, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}