{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 2, 22, 22], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"strides": [4, 4], "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_size": [8, 8], "filters": 32}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_size": [3, 3], "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 16, "trainable": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 4, "trainable": true, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "units": 1, "trainable": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_3"}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.2"}