{"class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 2, 22, 22], "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "kernel_size": [8, 8], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "strides": [4, 4], "bias_constraint": null}, "name": "conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_constraint": null}, "name": "conv2d_2"}, {"class_name": "Flatten", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_2"}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_3"}], "name": "model_1", "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}}