{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [4, 4], "activation": "relu", "bias_regularizer": null, "filters": 16, "trainable": true, "kernel_size": [6, 6], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_1", "data_format": "channels_first", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_2", "data_format": "channels_first", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_3", "data_format": "channels_first", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "units": 4, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "kernel_constraint": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]]}}