{"config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 1, 62, 62], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "relu", "kernel_constraint": null, "kernel_size": [8, 8], "use_bias": true, "bias_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "strides": [4, 4], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 32, "data_format": "channels_first"}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activation": "relu", "kernel_constraint": null, "kernel_size": [4, 4], "use_bias": true, "bias_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "data_format": "channels_first"}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "data_format": "channels_first"}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "softmax", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_3", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_3", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model"}