{"keras_version": "2.0.2", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 2, 22, 22]}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [8, 8], "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "trainable": true, "bias_constraint": null, "activation": "relu", "strides": [4, 4], "name": "conv2d_1", "dilation_rate": [1, 1]}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "trainable": true, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "name": "conv2d_2", "dilation_rate": [1, 1]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "units": 16}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "units": 4}}], "input_layers": [["input_1", 0, 0]]}}