{"class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 1, 22, 22], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "padding": "valid", "filters": 32, "activation": "relu", "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [6, 6], "activity_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "padding": "valid", "filters": 64, "activation": "relu", "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [4, 4], "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "padding": "valid", "filters": 32, "activation": "relu", "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4}}], "output_layers": [["dense_2", 0, 0]]}}