{"backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"filters": 16, "activity_regularizer": null, "kernel_size": [6, 6], "use_bias": true, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "data_format": "channels_first", "bias_constraint": null, "trainable": true, "strides": [4, 4], "activation": "relu"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"filters": 32, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "data_format": "channels_first", "bias_constraint": null, "trainable": true, "strides": [2, 2], "activation": "relu"}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"filters": 32, "activity_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "data_format": "channels_first", "bias_constraint": null, "trainable": true, "strides": [1, 1], "activation": "relu"}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 16, "bias_constraint": null, "trainable": true, "activation": "relu"}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "units": 4, "bias_constraint": null, "trainable": true, "activation": "softmax"}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.0.2", "class_name": "Model"}