{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_size": [6, 6], "activity_regularizer": null, "filters": 16, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "strides": [4, 4], "activation": "relu", "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null}}, {"name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "strides": [2, 2], "activation": "relu", "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null}}, {"name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_size": [2, 2], "activity_regularizer": null, "filters": 32, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null}}, {"name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null}}]}, "keras_version": "2.0.2"}