{"keras_version": "2.0.2", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 2, 22, 22], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"activation": "relu", "data_format": "channels_first", "kernel_constraint": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [12, 12], "name": "conv2d_1", "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"activation": "relu", "data_format": "channels_first", "kernel_constraint": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "name": "conv2d_2", "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"activation": "relu", "data_format": "channels_first", "kernel_constraint": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "name": "conv2d_3", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"activation": "relu", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"activation": "softmax", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 3, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}