{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "kernel_constraint": null, "padding": "valid", "filters": 16, "use_bias": true, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [4, 4], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "conv2d_1", "kernel_size": [6, 6], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "use_bias": true, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "use_bias": true, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "conv2d_3", "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "name": "dense_3", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow"}