{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 16, "name": "conv2d_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [4, 4], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "trainable": true, "strides": [4, 4], "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 32, "name": "conv2d_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "trainable": true, "strides": [2, 2], "activation": "relu"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 32, "name": "conv2d_3", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "trainable": true, "strides": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 16, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 4, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.2"}