{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 8, "subsample": [4, 4], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 2, 52, 52], "W_regularizer": null, "activation": "relu", "nb_row": 8}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 9216, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}}]}