{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_1", "filters": 16, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [4, 4], "activation": "relu", "kernel_size": [6, 6], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_2", "filters": 32, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [2, 2], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_3", "filters": 32, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 16, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "units": 4, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Model"}