{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "batch_input_shape": [null, 1, 32, 32], "name": "conv2d_1", "kernel_constraint": null, "strides": [4, 4], "activation": "relu", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "filters": 16, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "name": "conv2d_2", "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "use_bias": true, "name": "conv2d_3", "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}