{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "dtype": "float32", "trainable": true, "strides": [4, 4], "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 32, 32], "kernel_size": [4, 4], "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "trainable": true, "strides": [2, 2], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [2, 2], "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [2, 2], "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 256, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 4, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}