{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 1, 32, 32], "kernel_size": [6, 6], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "strides": [4, 4], "filters": 16, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "strides": [2, 2], "filters": 32, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "strides": [1, 1], "filters": 32, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 256, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 3, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}