{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "filters": 16, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_size": [6, 6], "strides": [4, 4], "data_format": "channels_first", "bias_regularizer": null}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "strides": [2, 2], "data_format": "channels_first", "bias_regularizer": null}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_size": [2, 2], "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "units": 16, "kernel_constraint": null, "bias_constraint": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "units": 4, "kernel_constraint": null, "bias_constraint": null}}], "output_layers": [["dense_2", 0, 0]]}}