{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 1, 32, 32], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"strides": [4, 4], "data_format": "channels_first", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 6], "padding": "valid", "filters": 16, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_first", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "padding": "valid", "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "data_format": "channels_first", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 2], "padding": "valid", "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 16, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 4, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model"}