{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0], ["dense_3", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "name": "input_1", "sparse": false}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "kernel_size": [6, 6], "name": "conv2d_1", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [4, 4], "kernel_regularizer": null, "data_format": "channels_first", "filters": 16, "activation": "relu"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "kernel_size": [2, 2], "name": "conv2d_3", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 16, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 4, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.2"}