{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1, 42, 42], "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [4, 4], "kernel_size": [4, 4], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_first", "use_bias": true, "activity_regularizer": null, "name": "conv2d_1", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 2], "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "filters": 32, "use_bias": true, "name": "conv2d_2", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 2], "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "filters": 32, "use_bias": true, "name": "conv2d_3", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 256, "use_bias": true, "name": "dense_1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 3, "use_bias": true, "name": "dense_2", "activation": "linear"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}