{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 1, 42, 42]}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "strides": [4, 4], "padding": "valid", "data_format": "channels_first", "kernel_size": [4, 4]}, "name": "conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "kernel_size": [2, 2]}, "name": "conv2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "kernel_size": [2, 2]}, "name": "conv2d_3"}, {"class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 16}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 3}, "name": "dense_2"}]}, "keras_version": "2.0.2"}